import 'package:flutter/material.dart';
import 'package:halal/constants/constants.dart';
import 'package:halal/views/widgets/belhalal_logo.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({ Key? key }) : super(key: key);

  @override
  Widget build(BuildContext context) {
    double width = MediaQuery.of(context).size.width;
    double height = MediaQuery.of(context).size.height;
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(
          onPressed:(){Navigator.pop(context);},
          icon:const Icon(Icons.arrow_back,color: Colors.white),),
          backgroundColor: kPrimaryColor,
          elevation: 0,
      ),
      backgroundColor: kPrimaryColor,
      body:Center(
        child: Padding(
          padding: const EdgeInsets.only(top:10),
          child: Column(
            children: [
              BelhalaLogo(height: height, width: width,logoLabel: 'بالحلال',),
              Container(
                color: Colors.white,
                width: width/1.1,
                height: height/1.5,
                child: Padding(
                  padding: const EdgeInsets.only(top:10,right:15),
                  child: ListView(
                    children: const [
                      Text(''' 
سياسة الخصوصية
Bl7alal.com هو تطبيق مواعدة. توفر منتجاتنا وخدماتنا وغيرها من الخدمات المرتبطة بسياسة الخصوصية هذه طرقًا سريعة وجيدة للتعبير عن نفسك للآخرين.
عند استخدامك لهذه الخدمات ، ستشارك بعض المعلومات معنا. لذلك نريد أن نكون صريحين بشأن المعلومات التي نجمعها ، وكيف نستخدمها ، ومع من نشاركها ، وعناصر التحكم التي نوفرها لك للوصول إلى معلوماتك وتحديثها وحذفها.
لهذا السبب كتبنا سياسة الخصوصية هذه.
المعلومات التي نجمعها
هناك ثلاث فئات أساسية من المعلومات التي نجمعها:
• المعلومات التي تقدمها.
• المعلومات التي نحصل عليها عندما تستخدم خدماتنا.
• المعلومات التي نحصل عليها من أطراف ثالثة.
إليك المزيد من التفاصيل حول كل فئة من هذه الفئات.
المعلومات التي تقدمها
عندما تتفاعل مع خدماتنا ، فإننا نجمع المعلومات التي تزودنا بها. على سبيل المثال ، تتطلب منك العديد من خدماتنا إنشاء حساب ، لذلك قد نحتاج إلى جمع بعض التفاصيل المهمة عنك ، مثل اسمك واسم المستخدم وكلمة المرور وعنوان البريد الإلكتروني . قد نطلب منك أيضًا تزويدنا ببعض المعلومات الإضافية التي ستكون مرئية للعامة في خدماتنا ، مثل صورة الملف الشخصي.
يجب أن يلتزم المستخدم بتقديم الأسماء والمعلومات والصور التي يشارك فيها التطبيق  بحيث تكون أسماء لائقة غير خادشة للحياء، ولا تستخدم أسماء أو صور تحتوي على تجاوزات (جنسية ، عنصرية ، إرهابية ، تحمل في طياتها عنف أو تنمر، أنشطة غير مشروعة ) وفي حال تم اكتشاف أي تجاوزات سنتخذ الإجراءات اللازمة بحيث ممكن أن يتم الغاء حسابك لدينا.
عندما تتصل بدعم العملاء أو تتواصل معنا بأي طريقة أخرى ، سنجمع أي معلومات تتطوع بها أو نحتاجها لحل سؤالك.
المعلومات التي نحصل عليها عند استخدام خدماتنا
عندما تستخدم خدماتنا ، نجمع معلومات حول الخدمات التي استخدمتها وكيفية استخدامها. بضع لقطات. فيما يلي شرح أكمل لأنواع المعلومات التي نجمعها عند استخدام خدماتنا:
• معلومات الاستخدام. نقوم بجمع معلومات حول نشاطك من خلال خدماتنا. على سبيل المثال ، قد نجمع معلومات حول:
o كيف تتفاعل مع خدماتنا ، مثل استعلامات البحث التي ترسلها.
كيف تتواصل مع الآخرين ، مثل أسمائهم ، ووقت اتصالاتك وتاريخها ، وعدد الرسائل التي تتبادلها مع أصدقائك ، والأصدقاء الذين تتبادل معهم الرسائل أكثر من غيرهم ، وتفاعلك مع الرسائل
• الكاميرا والصور. تتطلب منا العديد من خدماتنا جمع الصور والمعلومات الأخرى من الكاميرا والصور بجهازك. على سبيل المثال ، لن تتمكن من إرسال الصور أو تحميلها من ألبوم الكاميرا إلا إذا تمكنا من الوصول إلى الكاميرا أو الصور.
• معلومات السجل. نقوم أيضًا بجمع معلومات السجل عند استخدامك لموقعنا ، مثل:
o تفاصيل حول كيفية استخدامك لخدمتنا
o معلومات الجهاز ، مثل نوع متصفح الويب ولغته
أوقات الوصول
الصفحات التي شوهدت
o عنوان IP
o المعرفات المرتبطة بملفات تعريف الارتباط أو غيرها من التقنيات التي قد تحدد بشكل فريد جهازك أو متصفحك ؛ و
كيف نستخدم المعلومات
ماذا نفعل مع المعلومات التي نجمعها: تزويدك بمجموعة مذهلة من المنتجات والخدمات التي نعمل على تحسينها بلا هوادة. فيما يلي طرق القيام بذلك:
• تطوير منتجاتنا وخدماتنا وتشغيلها وتحسينها وتقديمها وصيانتها وحمايتها.
• إرسال الاتصالات لك ، بما في ذلك عن طريق البريد الإلكتروني. على سبيل المثال ، قد نستخدم البريد الإلكتروني للرد على استفسارات الدعم أو لمشاركة المعلومات حول منتجاتنا وخدماتنا والعروض الترويجية التي نعتقد أنها قد تهمك.
• رصد وتحليل الاتجاهات والاستخدام.
• في العثور على بعضهم البعض التطبيقات والخدمات التابعة والخاصة بالجهات الخارجية ، أو تخصيص المحتوى الذي نعرضه لك ، بما في ذلك الإعلانات.
• تعزيز سلامة وأمن منتجاتنا وخدماتنا.
• التحقق من هويتك ومنع الاحتيال أو أي نشاط غير مصرح به أو غير قانوني.

تعزيز خدماتنا وتجربتك معهم.
• فرض ، والتحقيق ، والإبلاغ عن السلوك الذي ينتهك شروط الخدمة وسياسات الاستخدام الأخرى لدينا ، والاستجابة لطلبات تطبيق القانون ، والامتثال للمتطلبات القانون.
كيف نشارك المعلومات
قد نشارك معلومات عنك بالطرق التالية:
• مع مستخدمي تطبيق بالحلال . قد نشارك المعلومات التالية مع مستخدمي
o معلومات عنك ، مثل اسم المستخدم والاسم و ملف الزواج.
o معلومات حول جهازك ، مثل نظام التشغيل ونوع الجهاز ، لمساعدتك في تلقي الدردشات والـ والمحتويات الأخرى بتنسيق العرض 
o معلومات عامة مثل اسمك واسم المستخدم وصور الملف الشخصي والملف الشخصي العام.
• مع أطراف ثالثة. يجوز لنا مشاركة المعلومات مع جهات خارجية بالطرق التالية:
o قد نشارك معلومات عنك مع مزودي الخدمة الذين يؤدون خدمات نيابة عنا ، بما في ذلك تسهيل المدفوعات وقياس أداء الإعلانات وتحسينه وتقديم إعلانات أكثر صلة ، بما في ذلك على مواقع وتطبيقات الطرف الثالث.
o قد نشارك معلومات عنك مع شركاء الأعمال الذين يقدمون خدمات ووظائف على خدماتنا. لمزيد من المعلومات حول المعلومات التي تم جمعها من قبل أطراف ثالثة على خدماتنا ، قم بزيارة موقع الدعم الخاص بنا.
o قد نشارك معلومات عنك ، مثل معلومات الجهاز والاستخدام ، لمساعدتنا والآخرين على منع الاحتيال.
o قد نشارك معلومات عنك لأسباب قانونية تتعلق بالسلامة والأمن. قد نشارك معلومات عنك إذا اعتقدنا بشكل معقول أن الكشف عن المعلومات ضروري من أجل:
o الامتثال لأي إجراء قانوني صالح أو طلب حكومي أو قانون أو قاعدة أو لائحة معمول بها.
o التحقيق في انتهاكات شروط الخدمة وإرشادات المجتمع المحتملة أو تصحيحها أو تنفيذها.
o حماية حقوقنا أو ممتلكاتنا أو سلامتنا أو مستخدمينا أو غيرهم.
o الكشف عن أي احتيال أو مخاوف أمنية وحلها.
• المعلومات غير الشخصية. قد نشارك أيضًا مع أطراف ثالثة تقدم خدمات لنا أو تؤدي أغراضًا تجارية لنا معلومات مجمعة أو غير شخصية أو مجهولة الهوية.
محتوى الطرف الثالث وعمليات التكامل
.
نقوم بتخزين المعلومات الأخرى لفترات زمنية أطول. على سبيل المثال:
• نقوم بتخزين معلومات حسابك الأساسية - مثل اسمك وعنوان بريدك الإلكتروني - وقائمة الأصدقاء حتى تطلب منا حذفها.
• نقوم بتخزين معلومات الموقع لفترات زمنية مختلفة بناءً على مدى دقتها والخدمات التي تستخدمها
إذا قررت التوقف عن استخدام ، يمكنك فقط أن تطلب منا حذف حسابك. سنحذف أيضًا معظم المعلومات التي جمعناها عنك بعد أن كنت غير نشط لفترة من الوقت!
.
السيطرة على المعلومات الخاصة بك
نريد منك أن تتحكم في معلوماتك ، لذلك نوفر لك الأدوات التالية.
• الوصول والتصحيح وقابلية النقل. يمكنك الوصول إلى معظم معلومات حسابك الأساسية وتعديلها في تطبيقاتنا مباشرة. يمكنك أيضًا استخدام تنزيل بياناتي للحصول على نسخة من المعلومات غير المتوفرة في تطبيقاتنا بتنسيق محمول ، بحيث يمكنك نقلها أو تخزينها في أي مكان تريده. نظرًا لأن خصوصيتك مهمة بالنسبة لنا ، فسنطلب منك التحقق من هويتك أو تقديم معلومات إضافية قبل أن نسمح لك بالوصول إلى معلوماتك الشخصية أو تحديثها. قد نرفض أيضًا طلبك للوصول إلى معلوماتك الشخصية أو تحديثها لعدد من الأسباب ، بما في ذلك ، على سبيل المثال ، إذا كان الطلب يهدد خصوصية المستخدمين الآخرين أو كان غير قانوني.
• إبطال الأذونات. في معظم الحالات ، إذا سمحت لنا باستخدام معلوماتك ، يمكنك ببساطة إبطال إذنك عن طريق تغيير الإعدادات في التطبيق أو على جهازك إذا كان جهازك يوفر هذه الخيارات. بالطبع ، إذا قمت بذلك ، فقد تفقد بعض الخدمات وظائفها الكاملة.
•	حذف حسابك في بالحلال. بينما نأمل أن تظل أحد مستخدمي مدى الحياة ، إذا كنت تريد حذف حسابك لسبب ما ، فما عليك سوى الضغط على زر الحذف داخل التطبيق. يمكنك أيضًا حذف بعض المعلومات في التطبيق ، مثل الصور التي حفظتها في الذكريات 
• التواصل مع مستخدمي الآخرين. من المهم بالنسبة لنا أن تظل متحكمًا في الأشخاص الذين تتواصل معهم. لهذا السبب أنشأنا عددًا من الأدوات في الإعدادات التي تتيح لك الإشارة ، من بين أشياء أخرى، وعليه فان المستخدم يلتزم بأسلوب الخطاب المحترم والكلمات المناسبة وبحال التجاوز سيتم استبعاده لذلك يتيح التطبيق : الحظر والمسح والتبيلغ . وفي حالة أي بلاغ يصلنا من أي مستخدم او شكوى ستتخذ إجراءات حول حسابك بعد التحقق وتواصل فريقنا معك لاخبارك بالتجاوزات التي قمت بها. 
عمليات نقل البيانات الدولية
يجوز لنا جمع معلوماتك الشخصية ونقلها إليها وتخزينها ومعالجتها في الولايات المتحدة وبلدان أخرى خارج المكان الذي تعيش فيه. عندما نشارك المعلومات خارج المكان الذي تعيش فيه ، عندما يُطلب منا قانونًا القيام بذلك ، فإننا نتأكد من وجود آلية نقل مناسبة. كما نتأكد أيضًا من أن أي أطراف ثالثة نشارك المعلومات لديها آلية نقل مناسبة مطبقة أيضًا.
أطفال
خدماتنا ليست مخصصة - ولا نوجهها - إلى أي شخص أقل من 21 عامًا حيث صمم التطبيق بطريقة اختيار العمر من قائمة ٢١ سنة فما فوق وكذلك في البحث فان العمر المتاح من ٢١ سنة فما فوق ، وبالتالي اذا تم اكتشاف أي مستخدم اقل من العمر القانونية فاننا سنتخذ اجراءاتنا في الغاء حسابه .
تنقيحات سياسة الخصوصية
قد نقوم بتغيير سياسة الخصوصية هذه من وقت لآخر. ولكن عندما نفعل ذلك ، سنخبرك بطريقة أو بأخرى.

عملية استرداد اموال اشتراك عضو

يجب تقديم سبب يجعل العضو يرغب لاسترداد امواله بعد ان يقدم جميع المستندات والاثباتات التي تطلب منه وسينظر في طلبه خلال 5 ايام عمل
 
'''
,textAlign: TextAlign.right,textDirection:TextDirection.rtl ,),
                      
                    ],
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}